Case_set_up/Temp_Effect/T500/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet_gas
    {
        type            patch;
        nFaces          60;
        startFace       29975;
    }
    inlet_coolant
    {
        type            patch;
        nFaces          10;
        startFace       30035;
    }
    outlet
    {
        type            patch;
        nFaces          60;
        startFace       30045;
    }
    topwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          250;
        startFace       30105;
    }
    bottom_plate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       30355;
    }
    hole_wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          30;
        startFace       30595;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          30300;
        startFace       30625;
    }
)

// ************************************************************************* //
