Case_set_up/Temp_Effect/T500/Allrun
blockMesh
decomposePar 
mpirun -np 6 buoyantBoussinesqSimpleFoam -parallel 
reconstructPar 

